SpenceKonde/ATTinyCore/avr/libraries/Servo/src/avr/Servo.cpp
/*
 Servo.cpp - Interrupt driven Servo library for Arduino using 16 bit timers- Version 2
 Copyright (c) 2009 Michael Margolis.  All right reserved.
 Copyright (c) 2011 Ilya Brutman.  All right reserved.
 Copyright (c) 2019 Spence Konde.  All right reserved.

 This library is free software; you can redistribute it and/or
 modify it under the terms of the GNU Lesser General Public
 License as published by the Free Software Foundation; either
 version 2.1 of the License, or (at your option) any later version.

 This library is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 Lesser General Public License for more details.

 You should have received a copy of the GNU Lesser General Public
 License along with this library; if not, write to the Free Software
 Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
 */

#if defined(ARDUINO_ARCH_AVR)

#include <avr/interrupt.h>
#include <Arduino.h>

#include "Servo.h"

#if (defined(__AVR_ATtinyX5__) || defined (__AVR_ATtinyX61__))


#define TCNTn   TCNT1
#define OCRnx   OCR1A
#define OCFnx   OCF1A
#define OCIEnx  OCIE1A
// Trim Duration is about the total combined time spent inside the Compare Match ISR
// This time is in timer ticks, where each tick is always 8 microseconds.
#define TRIM_DURATION 4


// This is the driver class responsible for generating the servo control pulses
// This class is purely static.
class ServoSequencer {
  public:
    //=============================================================================
    // Servo Sequencer public functions
    //=============================================================================
    static uint8_t  registerServo();
    //              Reserves a slot for a servo in the pulse sequence

    static void     deregisterServo(uint8_t servoSlotNumber);
    //              Frees an occupied slot

    static void     setServoPulseLength(uint8_t servoNumber, uint16_t newLengthInMicroseconds);
    //              Updates the pulse length of a servo to a new value

    static uint16_t getServoPulseLength(uint8_t servoNumber);
    //              returns the pulse length of a servo in microseconds

    static void     setServoPin(uint8_t servoNumber, uint8_t newPin);
    //              Updates the pin that will be pulsed

    static void     enableDisableServo(uint8_t servoNumber, bool servoShouldBeEnabled);
    //              Enable or disable a servo in a slot. A pulse is not generated for a servo slot that is disabled.

    static bool     isEnabled(uint8_t servoNumber);
    //              returns true is the servo is enabled

    inline static void timerCompareMatchISR();
    //              Handles a timer compare match.
    //              Should only be called when the timer compare match interrupt fires.

    //=============================================================================
    // Servo Sequencer public constants
    //=============================================================================
    //static const uint8_t kInvalidServoIndex = 0xFF;



  private:
  //=============================================================================
  // Servo Sequencer types
  //=============================================================================
  //This enum defines the states of the Servo Sequencer
    enum SequencerState_t {
      WAITING_FOR_512_MARK,
      WAITING_TO_SET_PIN_LOW,
      WAITING_FOR_2048_MARK,
      WAITING_TO_SET_PIN_HIGH
    };

    //This struct defines a single servo slot
    struct ServoEntry {
      uint8_t  pulseLengthInTicks;    //length of pulse in ticks after offset is applied
      uint8_t  pin;                   //which pin to pulse on portB
      bool     enabled;               //True when this servo should be pulsed
      bool     slotOccupied;          //True when this servo entry is allocated to a servo
    };

    //=============================================================================
    // Servo Sequencer private variables
    //=============================================================================
    //The number of servos to support. See NOTE1 below.
    static volatile SequencerState_t  state;                            //The current state of the driver
    static          bool              timerIsSetup;                     //True if the timer used by this driver was configured
    static          bool              servoArrayIsInited;               //True if the servo Registry array was initialized with default values.
    static          ServoEntry        servoRegistry[MAX_SERVOS]; //The array of servo slots
    static volatile uint8_t           servoIndex;                       //The index of the current servo slot we are working with.
                                                                //With 5 servos, we go through the whole servoRegistry every 20 milliseconds exactly.

    //=============================================================================
    // Servo Sequencer private functions
    //=============================================================================
    //This is a purely static class. Disallow making instances of this class.
    ServoSequencer();              //private constructor
    static void servoTimerSetup(); //Configures the timer used by this driver
    static void setupTimerPrescaler(); //helper function to setup the prescaler
    static void initServoArray();  //sets default values to each element of the servoRegistry array

}; //end ServoSequencer



//=============================================================================
// Servo Sequencer static variables initialization
//=============================================================================
volatile  ServoSequencer::SequencerState_t  ServoSequencer::state              = ServoSequencer::WAITING_TO_SET_PIN_HIGH;
bool                                        ServoSequencer::timerIsSetup       = false;
bool                                        ServoSequencer::servoArrayIsInited = false;
volatile uint8_t                            ServoSequencer::servoIndex         = 0;
ServoSequencer::ServoEntry                  ServoSequencer::servoRegistry[MAX_SERVOS];

