SpenceKonde/ATTinyCore/avr/libraries/Servo/src/avr/Servo.cpp
//TODO: Add the rest of the class variables here for better organization?


//NOTE1:
// With 5 servos, each servo is pulsed exactly every 20 milliseconds. You can increase this number to have
// the driver support more servos. The servos are pulsed in sequence and each servo takes up 4 ms of time.
// So if you change this number to 6 then each servo will be pulsed every 24 milliseconds.



//=============================================================================
// FUNCTION:    bool registerServo()
//
// DESCRIPTION: Reserves a slot for a servo in the pulse sequence.
//              There is a limited number of slots.
//
// INPUT:       Nothing
//
// RETURNS:     On success returns the slot number.
//              If no free slot is found returns INVALID_SERVO.
//=============================================================================
uint8_t ServoSequencer::registerServo() {

  if (servoArrayIsInited == false) {
    initServoArray();
  } else {
    //the servo array is already inited. Do nothing.
    //It needs to be setup only once. We do it when the first servo is registered.
  }


  //find a free slot in the servo registry
  for (uint8_t i = 0; i < MAX_SERVOS; i++) {
    if (servoRegistry[i].slotOccupied == false) {
      //found a free slot.
      servoRegistry[i].slotOccupied = true;
      //return the slot number
      return i;
    } else {
      //this slot is not free, check the next one.
    }
  }
  //no free slots were found.
  return INVALID_SERVO;
}//end registerServo


//=============================================================================
// FUNCTION:    bool deregisterServo(uint8_t servoSlotNumber)
//
// DESCRIPTION: Frees up a slot in the pulse sequence.
//
// INPUT:       servoSlotNumber - The slot number to deallocate.
//
// RETURNS:     Nothing
//=============================================================================
void ServoSequencer::deregisterServo(uint8_t servoSlotNumber) {
  //make sure we got a valid slot number
  if (servoSlotNumber < MAX_SERVOS) {
    servoRegistry[servoSlotNumber].enabled      = false;
    servoRegistry[servoSlotNumber].slotOccupied = false;
  servoRegistry[servoSlotNumber].pulseLengthInTicks = 128; //restore the pulse length to the default setting.
  } else {
    //we got a slot number that is out of range. Do nothing.
  }
}//end deregisterServo





//=============================================================================
// FUNCTION:    void setServoPulseLength(uint8_t servoNumber, uint16_t newLengthInMicroseconds)
//
// DESCRIPTION: Updates a servo slots with a new pulse length.
//              Only works on allocated slots.
//
// INPUT:       servoNumber - the slot number to update
//              newLengthInMicroseconds - the new pulse length to set
//
// RETURNS:     Nothing
//=============================================================================
void ServoSequencer::setServoPulseLength(uint8_t servoNumber, uint16_t newLengthInMicroseconds) {
  //make sure we got a valid slot number and the slot is registered to a servo
  if ((servoNumber < MAX_SERVOS) && (servoRegistry[servoNumber].slotOccupied == true)) {
    //Convert the servo pulse length into timer ticks.
    //Each timer tick is 8 microseconds.
    int16_t newLengthInClockTicks = newLengthInMicroseconds / 8;
    //subtract the pulse offset
    newLengthInClockTicks -= 64;

    //make sure the length of this pulse is within the acceptable range
    if ((newLengthInClockTicks > -1) && (newLengthInClockTicks < 256)) {
      servoRegistry[servoNumber].pulseLengthInTicks = static_cast < uint8_t>(newLengthInClockTicks);
      //Programming note: If pulseLengthInTicks is ever changed to be larger than 1 byte in size then
      //                 interrupts would need to be disabled when updating it to a new value.
    } else {
      //The new pulse length is too short or long than what we can generate
    }
  } else {
    //Servo number is out of range or is not allocate to a servo. Do nothing.
  }
}//end setServoPulseLength



//=============================================================================
// FUNCTION:    void getServoPulseLength(uint8_t servoNumber)
//
// DESCRIPTION: Gets the pulse length of a servo slot.
//              Only works on allocated slots.
//
// INPUT:       servoNumber - which slot to get the pulse length from
//
// RETURNS:     The pulse length in microseconds
//=============================================================================
uint16_t ServoSequencer::getServoPulseLength(uint8_t servoNumber) {
  uint16_t pulseLength = 0;

  //make sure we got a valid slot number and the slot is registered to a servo
  if ((servoNumber < MAX_SERVOS) && (servoRegistry[servoNumber].slotOccupied == true)) {
    pulseLength = (servoRegistry[servoNumber].pulseLengthInTicks * 8) + 64;
  } else {
    //Servo number is out of range or is not allocate to a servo. Do nothing.
  }
  return pulseLength;
}//end getServoPulseLength


//=============================================================================
// FUNCTION:    void setServoPin(uint8_t servoNumber, uint8_t newPin)
//
// DESCRIPTION: Sets which pin on PortB should be pulsed for a servo slot.
//
// INPUT:       servoNumber - which servo slot to update
//              newPin - which pin on portB should be pulsed
//
// RETURNS:     Nothing
//
//=============================================================================
void ServoSequencer::setServoPin(uint8_t servoNumber, uint8_t newPin) {
  //make sure we got a valid slot number and the slot is registered to a servo
  if ((servoNumber < MAX_SERVOS) && (servoRegistry[servoNumber].slotOccupied == true)) {
    servoRegistry[servoNumber].pin = newPin;
  } else {
    //Servo number is out of range or is not allocate to a servo. Do nothing.
  }
}//end setServoPin


//=============================================================================
// FUNCTION:    void enableDisableServo(uint8_t servoNumber, bool servoShouldBeEnabled)
//
// DESCRIPTION: Enabled or disables an allocated servo slot.
//              An enabled slot generates a pwm wave on its pin.
//              A disabled slot does not.
//
// INPUT:       servoNumber - which servo slot to update
//              servoShouldBeEnabled - true to enable the servo slot
//                                     false to disable the servo slot
//
// RETURNS:     Nothing
//
//=============================================================================
void ServoSequencer::enableDisableServo(uint8_t servoNumber, bool servoShouldBeEnabled) {

  //make sure we got a valid slot number and the slot is registered to a servo
  if ((servoNumber < MAX_SERVOS) && (servoRegistry[servoNumber].slotOccupied == true)) {
    if (servoShouldBeEnabled == true) {
      //if this is the very first servo we are enabling then configure the servo timer
      if (timerIsSetup == false) {
        servoTimerSetup();
        timerIsSetup = true;
      } else {
        //The timer is already setup. Do nothing.
        //It needs to be setup only once. We do it when the first servo is enabled.
        //We setup the timer as late as possible. This allows this servo library
        //to be more compatible with various frameworks written for the attiny45/85,
        //which typically configure all the timers to their liking on start up.
        //Configuring our timer late allows us to overwrite these settings.
      }
      //enable the servo. Its pulse will now be output on its pin.
      servoRegistry[servoNumber].enabled = true;
    } else {
      //disable the servo. Its pulse will cease to be generated.
      servoRegistry[servoNumber].enabled = false;
      //TODO: set this servo pin low, if it is high.
      //      Actually, ideally the pulse should finish by itself
      //      forcing the pin low will generate a weird length pulse for the servo
      //      Need to add some sort of "disable pending" status
    }
  } else {
    //Servo number is out of range or is not allocate to a servo. Do nothing.
  }
}//end enableDisableServo



