SpenceKonde/ATTinyCore/avr/libraries/Servo/src/avr/Servo.cpp
//=============================================================================
// FUNCTION:    bool isEnabled(uint8_t servoNumber)
//
// DESCRIPTION: Determines if a servo slot is enabled.
//
// INPUT:       servoNumber - which servo slot to check
//
// RETURNS:     true if the slot is enabled
//              false if it is disabled or not allocated to a servo.
//
//=============================================================================
bool ServoSequencer::isEnabled(uint8_t servoNumber) {
  //make sure we got a valid slot number and the slot is registered to a servo
  if ((servoNumber < MAX_SERVOS) && (servoRegistry[servoNumber].slotOccupied == true)) {
    return servoRegistry[servoNumber].enabled;
  } else {
    //Servo number is out of range or is not allocate to a servo.
    //So therefore it is not enabled.
    return false;
  }
}//end isEnabled


//=============================================================================
// FUNCTION:    void servoTimerSetup()
//
// DESCRIPTION: Sets up the timer used by this servo driver
//              No servo pulses can be generated until this function is called.
//
// INPUT:       Nothing
//
// RETURNS:     Nothing
//
//=============================================================================
void ServoSequencer::servoTimerSetup() {
  //set up the timer prescaler based on which timer was selected and our F_CPU clock
  setupTimerPrescaler();
  #ifdef __AVR_ATtinyX61__
  TCCR1A = 0;
  #endif
  // Enable Output Compare Match Interrupt
  TIMSK |= (1 << OCIEnx);

  //reset the counter to 0
  TCNTn  = 0;
  //set the compare value to any number larger than 0
  OCRnx = 255;
  // Enable global interrupts
  sei();

  /*
  TCNT0 - The Timer/Counter
  OCR0A and OCR0B - Output Compare Registers
  TIFR0 - Timer Interrupt Flag Register
  TIMSK - Timer Interrupt Mask Register
  TCCR0B Timer/Counter Control Register B
  */

}//end servoTimerSetup


//=============================================================================
// FUNCTION:    void setupTimerPrescaler()
//
// DESCRIPTION: Helper function that sets up the timer prescaller based on what
//              timer is selected and the F_CPU frequency.
//
// INPUT:       Nothing
//
// RETURNS:     Nothing
//
//=============================================================================
/* *INDENT-OFF* */
void ServoSequencer::setupTimerPrescaler() {
  #if defined(__AVR_ATtinyX5__)
    // No need to reset TCCR1 since we set it directly below.
  #if defined(PLLTIMER1) //&& (F_CPU!=16500000L)
    //set counter1 prescaler to 512
    //our timer clock is 64 MHz so this makes each timer tick be 8 microseconds long
    //TCCR1 |=  (1<< CS13); //set
    //TCCR1 &= ~(1<< CS12); //clear
    //TCCR1 |=  (1<< CS11); //set
    //TCCR1 &= ~(1<< CS10); //clear
    TCCR1 = 0x0A;
  #elif defined (LOWPLLTIMER1)// && (F_CPU!=16500000L)
    //set counter1 prescaler to 256
    //our timer clock is 32 MHz so this makes each timer tick be 8 microseconds long
    //TCCR1 |=  (1<< CS13); //set
    //TCCR1 &= ~(1<< CS12); //clear
    //TCCR1 &= ~(1<< CS11); //clear
    //TCCR1 |=  (1<< CS10); //set
    TCCR1 = 0x09;
  #elif F_CPU == 8000000L
    //set counter1 prescaler to 64
    //our F_CPU is 8 MHz so this makes each timer tick be 8 microseconds long
    //TCCR1 &= ~(1<< CS13); //clear
    //TCCR1 |=  (1<< CS12); //set
    //TCCR1 |=  (1<< CS11); //set
    //TCCR1 |=  (1<< CS10); //set
    TCCR1 = 0x07;
  #elif (F_CPU == 16000000L || F_CPU==16500000L)//16 MHz
    //set counter1 prescaler to 128
    //our F_CPU is 16 MHz so this makes each timer tick be 8 microseconds long
    //TCCR1|=(1<<CS13)
    //TCCR1 &= ~(1<< CS12); //clear
    //TCCR1 &= ~(1<< CS11); //clear
    //TCCR1 &= ~(1<< CS10); //clear
    TCCR1 = 0x08;
  #elif F_CPU == 4000000L
    //set counter1 prescaler to 32
    //our F_CPU is 4 MHz so this makes each timer tick be 8 microseconds long
    //TCCR1 &= ~(1<< CS13); //clear
    //TCCR1 |=  (1<< CS12); //set
    //TCCR1 |=  (1<< CS11); //set
    //TCCR1 &= ~(1<< CS10); //clear
    TCCR1 = 0x07;
  #elif F_CPU == 1000000L
    //set counter1 prescaler to 8
    //our F_CPU is 1 MHz so this makes each timer tick be 8 microseconds long
    //TCCR1 &= ~(1<< CS13); //clear
    //TCCR1 |=  (1<< CS12); //set
    //TCCR1 &= ~(1<< CS11); //clear
    //TCCR1 &= ~(1<< CS10); //clear
    TCCR1 = 0x04;
  #else
    #error "Servo only supported at 1MHz, 8MHz and 16MHz on tiny25/45/85 unless PLL used as Timer1 clock source and PLL clock isn't 16.5 MHz."
  #endif
  #elif defined(__AVR_ATtinyX61__)
  // No need to reset TCCR1 since we set it directly below.
  #if defined(PLLTIMER1) //&& (F_CPU!=16500000L)
    //set counter1 prescaler to 512
    //our timer clock is 64 MHz so this makes each timer tick be 8 microseconds long
    //TCCR1B |=  (1<< CS13); //set
    //TCCR1B &= ~(1<< CS12); //clear
    //TCCR1B |=  (1<< CS11); //set
    //TCCR1B &= ~(1<< CS10); //clear
    TCCR1B = 0x0A;
  #elif defined (LOWPLLTIMER1) //&& (F_CPU!=16500000L)
    //set counter1 prescaler to 256
    //our timer clock is 32 MHz so this makes each timer tick be 8 microseconds long
    //TCCR1B |=  (1<< CS13); //set
    //TCCR1B &= ~(1<< CS12); //clear
    //TCCR1B &= ~(1<< CS11); //clear
    //TCCR1B |=  (1<< CS10); //set
    TCCR1B = 0x09;
  #elif F_CPU == 8000000L
    //set counter1 prescaler to 64
    //our F_CPU is 8 MHz so this makes each timer tick be 8 microseconds long
    //TCCR1B &= ~(1<< CS13); //clear
    //TCCR1B |=  (1<< CS12); //set
    //TCCR1B |=  (1<< CS11); //set
    //TCCR1B |=  (1<< CS10); //set
    TCCR1B = 0x07;
  #elif (F_CPU == 16000000L || F_CPU==16500000L) //16 MHz
    //set counter1 prescaler to 128
    //our F_CPU is 16 MHz so this makes each timer tick be 8 microseconds long
    //TCCR1B |=(1<<CS13)
    //TCCR1B &= ~(1<< CS12); //clear
    //TCCR1B &= ~(1<< CS11); //clear
    //TCCR1B &= ~(1<< CS10); //clear
    TCCR1B = 0x08;
  #elif F_CPU == 1000000L
    //set counter1 prescaler to 8
    //our F_CPU is 1 MHz so this makes each timer tick be 8 microseconds long
    //TCCR1 &= ~(1<< CS13); //clear
    //TCCR1 |=  (1<< CS12); //set
    //TCCR1 &= ~(1<< CS11); //clear
    //TCCR1 &= ~(1<< CS10); //clear
    TCCR1B = 4;
  #else
    #error "Servo only supported at 1MHz, 8MHz and 16MHz on tiny261/461/861 unless PLL used as Timer1 clock source and PLL clock isn't 16.5 MHz."
  #endif

  #endif
}//end setupTimerPrescaler
/* *INDENT-ON* */

