SpenceKonde/ATTinyCore/avr/libraries/Servo/src/avr/Servo.cpp
//=============================================================================
// FUNCTION:    void initServoArray()
//
// DESCRIPTION: Sets default values to each element of the servoRegistry array
//
// INPUT:       Nothing
//
// RETURNS:     Nothing
//
//=============================================================================
void ServoSequencer::initServoArray() {
  //init the Servo Registry array
  for (uint8_t i = 0; i < MAX_SERVOS; ++i) {
    servoRegistry[i].pulseLengthInTicks = 128;
    servoRegistry[i].pin = 0;
    servoRegistry[i].enabled = false;
    servoRegistry[i].slotOccupied = false;
  }

  servoArrayIsInited = true;
}//end initServoArray


//=============================================================================
// FUNCTION:    void timerCompareMatchISR()
//
// DESCRIPTION: Interrupt service routine for timer0 compare A match.
//              This is where the magic happens.
//
// INPUT:       Nothing
//
// RETURNS:     Nothing
//=============================================================================
void ServoSequencer::timerCompareMatchISR() {
  switch (state) {
    case WAITING_TO_SET_PIN_HIGH:
      //go to the next servo in the registry
      ++servoIndex;
      //if we are the end of the registry, go to the beginning of it
      if (servoIndex == MAX_SERVOS) {
        servoIndex = 0;
      } else {
        //we are not at the end, leave the servo index as is
      }

      //if this servo is enabled set the pin high
      if (servoRegistry[servoIndex].enabled == true) {
        #if defined(__AVR_ATtinyX5__)
        PORTB |= (1 << servoRegistry[servoIndex].pin);
        #elif defined(__AVR_ATtinyX61__)
        uint8_t bit = digitalPinToBitMask(servoRegistry[servoIndex].pin);
        uint8_t port = digitalPinToPort(servoRegistry[servoIndex].pin);
        volatile uint8_t *out;
        out = portOutputRegister(port);
        *out|=bit;
        #else
        #error "Unsupported part - how did execution get here?"
        #endif
      } else {
        //This servo position is not enabled, don't manipulate the pin
      }

      //reset the counter to 0
      TCNTn  = 0;
      //set the compare value to 64 (512 us). This is the constant pulse offset.
      OCRnx = 64 - TRIM_DURATION; //trim off 4 ticks (32us), this is about the total combined time we spent inside this ISR;
      //update our state
      state = WAITING_FOR_512_MARK;
      break;


    case WAITING_FOR_512_MARK:
      //set the compare value to the additional amount of timer ticks the pulse should last
      OCRnx = servoRegistry[servoIndex].pulseLengthInTicks;
      //update our state
      state = WAITING_TO_SET_PIN_LOW;

      //reset the counter to 0
      TCNTn  = 0;

      //Did we just set OCRnx to zero?
      if (OCRnx == 0) {
         //Since we are setting OCRnx and TCNTn to 0 we are not going to get an interrupt
         //until the counter overflows and goes back to 0.
         //set the counter its highest value, to have it overflow right away.
         TCNTn = 0xFF;
         //This will cause this interrupt to fire again almost immediately (at the next timer tick)
      } else {
        //otherwise we need to clear the OCF0A flag because it is possible that the
        //counter value incremented and matched the output compare value while this
        //function was being executed
        TIFR = (1 << OCF0A);  // write logical 1 to the OCF0A flag to clear it
        //                    // also have to write 0 to all other bits for this to work.
      }
      break;


    case WAITING_TO_SET_PIN_LOW:
      //if this servo is enabled set the pin low
      if (servoRegistry[servoIndex].enabled == true) {
        #if defined(__AVR_ATtinyX5__)
        PORTB &= ~(1 << servoRegistry[servoIndex].pin);
        #elif defined(__AVR_ATtinyX61__)
        uint8_t bit = digitalPinToBitMask(servoRegistry[servoIndex].pin);
        uint8_t port = digitalPinToPort(servoRegistry[servoIndex].pin);
        volatile uint8_t *out;
        out = portOutputRegister(port);
        *out&=~bit;
        #else
        #error "Unsupported part - how did execution get here?"
        #endif
      } else {
        //This servo position is not enabled, don't manipulate the pin
      }

      //check if the length of this pulse is 2048 microseconds or longer
      if ((64 + servoRegistry[servoIndex].pulseLengthInTicks) > 255) {
        //This pulse length has passed the 2048 us mark, so we skip state WAITING_FOR_2048_MARK
        //update state
        state = WAITING_TO_SET_PIN_HIGH;
        //set the compare value to the amount of time (in timer ticks) we need to wait to reach
        //4096 microseconds mark
        //which is 512 minus the total pulse length. (resulting number will be between 0 and 255 inclusive)
        OCRnx = 512 - (64 + servoRegistry[servoIndex].pulseLengthInTicks);
      } else {
        //This pulse length has not reached the 2048 us mark, therefore we have to get to that mark first
        //update state
        state = WAITING_FOR_2048_MARK;
        //set OCRnx to the amount of time (in timer ticks) we have to wait to reach this mark
        //which is 255 minus the total pulse length
        OCRnx = 255 - (64 + servoRegistry[servoIndex].pulseLengthInTicks);
      }

      //reset the counter to 0
      TCNTn  = 0;

      break;

    case WAITING_FOR_2048_MARK:
      //update state
      state = WAITING_TO_SET_PIN_HIGH;
      //reset the counter to 0
      TCNTn  = 0;
      //set the compare value to the longest length of time, 255 ticks, or 2040 microseconds
      //This will take us to the ~4096 microsecond mark,
      //at which point the cycle starts again with the next servo slot.
      OCRnx = 255;
      break;
  }//end switch
}//end timerCompareMatchISR




//=============================================================================
// Non Member Functions
//=============================================================================


//=============================================================================
// FUNCTION:    Interrupt service routine for Timer1 compare A match
//
// DESCRIPTION: AVR Libc provided function that is vectored into when the
//              timer0 compare A match interrupt fires.
//
// INPUT:       Nothing
//
// RETURNS:     Nothing
//=============================================================================
ISR(TIMER1_COMPA_vect) {
  ServoSequencer::timerCompareMatchISR();
}//end ISR TIM0_COMPA_vect


































