SpenceKonde/ATTinyCore/avr/libraries/Servo/src/avr/Servo.cpp
//=============================================================================
// Servo Class Functions
//=============================================================================

//=============================================================================
// FUNCTION:    constructor
//
// DESCRIPTION: Constructor
//
// INPUT:       Nothing
//
// RETURNS:     Nothing
//
//=============================================================================
Servo::Servo() {
  servoIndex = INVALID_SERVO;
  min = MIN_PULSE_WIDTH;
  max = MAX_PULSE_WIDTH;
}//end constructor

//=============================================================================
// FUNCTION:    destructor
//
// DESCRIPTION: destructor
//
// INPUT:       Nothing
//
// RETURNS:     Nothing
//
//=============================================================================
Servo::~Servo() {
  detach();
}//end destructor

//=============================================================================
// FUNCTION:    void attach(uint8_t pin)
//
// DESCRIPTION: Attaches a servo motor to an i/o pin on Port B.
//
// INPUT:       pin - which pin on portB to attach to
//
// RETURNS:     The servo number of this servo.
//
//=============================================================================
uint8_t Servo::attach(uint8_t pin) {

  //Do we need to register with the servo sequencer?
  delay(1000);
  if (servoIndex == INVALID_SERVO) {
  //Yep, we do, so register and save our servo number.
  servoIndex = ServoSequencer::registerServo();
  if (servoIndex == INVALID_SERVO) {
    //We got an invalid servo number. That means the servo sequencer is full and can't handle any more servos.
    return INVALID_SERVO;
  }
  }

  //valid pin values are between 0 and 5, inclusive.
  #if defined(__AVR_ATtinyX5__)
  if (pin <= 5) {
    DDRB |= (1<<pin); //set pin as output
    //set the servo pin
    ServoSequencer::setServoPin(servoIndex, pin);
    //enable the servo to start outputting the PWM wave
    ServoSequencer::enableDisableServo(servoIndex, true);
  }

  #elif defined(__AVR_ATtinyX61__)
  if (pin <= 16) {
    uint8_t bit = digitalPinToBitMask(pin);
    uint8_t port = digitalPinToPort(pin);
    volatile uint8_t *reg;
    if (port == NOT_A_PIN) {
      return INVALID_SERVO;
    }
    reg = portModeRegister(port);
    *reg |= bit;
    ServoSequencer::setServoPin(servoIndex, pin);
    //enable the servo to start outputting the PWM wave
    ServoSequencer::enableDisableServo(servoIndex, true);
  }
  #else
  #error "This part isn't supported - how did execution get here?"
  #endif
  else
  {
    //bad pin value. do nothing.
  }

  return servoIndex;

}//end attach





//=============================================================================
// FUNCTION:    uint8_t attach(uint8_t pin, uint16_t min, uint16_t max)
//
// DESCRIPTION: Attaches a servo motor to an i/o pin on Port B and also sets
//              the minimum and maximum pulse length values for this servo.
//
// INPUT:       pin - which pin on portB to attach to
//              min - minimum pulse length to use
//              max - maximum pulse length to use
//
// RETURNS:
//
//=============================================================================
uint8_t Servo::attach(uint8_t pin, uint16_t newMin, uint16_t newMax) {
  min = newMin;
  max = newMax;
  return attach(pin);
}//end attach with min/max


//=============================================================================
// FUNCTION:    void detach()
//
// DESCRIPTION: Stops an attached servos from pulsing its i/o pin.
//
// INPUT:       Nothing
//
// RETURNS:     Nothing
//
//=============================================================================
void Servo::detach() {
  ServoSequencer::deregisterServo(servoIndex);
  servoIndex = INVALID_SERVO;
}


//=============================================================================
// FUNCTION:    void write(uint16_t value)
//
// DESCRIPTION: Sets the servo angle in degrees.
//              invalid angle that is valid as pulse in microseconds is
//              treated as microseconds.
//
// INPUT:       value - position for the servo to move to
//
// RETURNS:     Nothing
//
//=============================================================================
void Servo::write(uint16_t value) {
  //make sure we have a valid servo number. If it's invalid then exit doing nothing.
  if (servoIndex == INVALID_SERVO) return;

  //for now, only accept angles, and angles that are between 0 and 200 degrees
  if (value > 180) {
    //treat this number as microseconds
    writeMicroseconds(value);
  } else {
    //treat this number as degrees
    uint16_t servoPulseLengthInUs = map(value, 0, 180, min, max);
    writeMicroseconds(servoPulseLengthInUs);
  }
}//end write


//=============================================================================
// FUNCTION:    void writeMicroseconds(uint16_t value)
//
// DESCRIPTION: Sets the servo pulse width in microseconds
//
// INPUT:       value - the pulse width of the servo pulse in microseconds
//
// RETURNS:     Nothing
//
//=============================================================================
void Servo::writeMicroseconds(uint16_t value) {
  //make sure we have a valid servo number. If it's invalid then exit doing nothing.
  if (servoIndex == INVALID_SERVO) return;

  ServoSequencer::setServoPulseLength(servoIndex, value);
}//end writeMicroseconds





//=============================================================================
// FUNCTION:    uint16_t readMicroseconds()
//
// DESCRIPTION: Gets the last written servo pulse width in microseconds.
//
// INPUT:       Nothing
//
// RETURNS:     The pulse width in microseconds
//
//=============================================================================
uint16_t Servo::readMicroseconds() {
  //make sure we have a valid servo number. If it's invalid then exit doing nothing.
  if (servoIndex == INVALID_SERVO) {
    return 0;
  }

  return ServoSequencer::getServoPulseLength(servoIndex);
}//end readMicroseconds


